IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_ADC3_RESULT_CONTROLSS_ADC3_RESULT.xml
<module name="CONTROLSS_ADC3_RESULT_CONTROLSS_ADC3_RESULT" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT0" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT0" offset="0x0" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 0 16-bit ADC result. After the ADC completes a conversion of SOC0, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT1" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT1" offset="0x2" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 1 16-bit ADC result. After the ADC completes a conversion of SOC1, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT2" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT2" offset="0x4" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 2 16-bit ADC result. After the ADC completes a conversion of SOC2, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT3" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT3" offset="0x6" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 3 16-bit ADC result. After the ADC completes a conversion of SOC3, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT4" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT4" offset="0x8" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 4 16-bit ADC result. After the ADC completes a conversion of SOC4, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT5" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT5" offset="0xA" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 5 16-bit ADC result. After the ADC completes a conversion of SOC5, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT6" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT6" offset="0xC" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 6 16-bit ADC result. After the ADC completes a conversion of SOC6, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT7" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT7" offset="0xE" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 7 16-bit ADC result. After the ADC completes a conversion of SOC7, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT8" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT8" offset="0x10" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 8 16-bit ADC result. After the ADC completes a conversion of SOC8, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT9" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT9" offset="0x12" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 9 16-bit ADC result. After the ADC completes a conversion of SOC9, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT10" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT10" offset="0x14" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 10 16-bit ADC result. After the ADC completes a conversion of SOC10, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT11" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT11" offset="0x16" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 11 16-bit ADC result. After the ADC completes a conversion of SOC11, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT12" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT12" offset="0x18" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 12 16-bit ADC result. After the ADC completes a conversion of SOC12, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT13" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT13" offset="0x1A" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 13 16-bit ADC result. After the ADC completes a conversion of SOC13, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT14" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT14" offset="0x1C" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 14 16-bit ADC result. After the ADC completes a conversion of SOC14, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCRESULT15" acronym="CONTROLSS_ADC3_RESULT_ADCRESULT15" offset="0x1E" width="16" description="">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 15 16-bit ADC result. After the ADC completes a conversion of SOC15, the digital result is placed in this bit field." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCPPB1RESULT" acronym="CONTROLSS_ADC3_RESULT_ADCPPB1RESULT" offset="0x20" width="32" description="">
		<bitfield id="SIGN" width="16" begin="31" end="16" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16. NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PPBRESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block Result 1 The result of the offset/reference subtraction post conversion processing is stored in this register. If ADCINTFLG is polled in reading PPBRESULT, user needs to add a NOP instruction to ensure that post conversion processing is populated in this register. NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCPPB2RESULT" acronym="CONTROLSS_ADC3_RESULT_ADCPPB2RESULT" offset="0x24" width="32" description="">
		<bitfield id="SIGN" width="16" begin="31" end="16" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16. NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PPBRESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block Result 2 The result of the offset/reference subtraction post conversion processing is stored in this register. If ADCINTFLG is polled in reading PPBRESULT, user needs to add a NOP instruction to ensure that post conversion processing is populated in this register. NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCPPB3RESULT" acronym="CONTROLSS_ADC3_RESULT_ADCPPB3RESULT" offset="0x28" width="32" description="">
		<bitfield id="SIGN" width="16" begin="31" end="16" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16. NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PPBRESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block Result 3 The result of the offset/reference subtraction post conversion processing is stored in this register. If ADCINTFLG is polled in reading PPBRESULT, user needs to add a NOP instruction to ensure that post conversion processing is populated in this register. NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_ADC3_RESULT_ADCPPB4RESULT" acronym="CONTROLSS_ADC3_RESULT_ADCPPB4RESULT" offset="0x2C" width="32" description="">
		<bitfield id="SIGN" width="16" begin="31" end="16" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16. NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PPBRESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block Result 4 The result of the offset/reference subtraction post conversion processing is stored in this register. If ADCINTFLG is polled in reading PPBRESULT, user needs to add a NOP instruction to ensure that post conversion processing is populated in this register. NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." range="15 - 0" rwaccess="RO"/>
	</register>
</module>